In [1]:
import pandas as pd
import numpy as np

In [2]:
info = {
    "Name" : ["Harsh","Rahul","Shreya"],
    "CGPA" : ["9.5","8.3","8.8"]
}
df = pd.DataFrame(info)

In [3]:
print(df)

     Name CGPA
0   Harsh  9.5
1   Rahul  8.3
2  Shreya  8.8

In [4]:
df

     Name CGPA
0   Harsh  9.5
1   Rahul  8.3
2  Shreya  8.8

In [5]:
#series 1 dimensional labeled array
s= pd.Series([1,2,3,4,5])
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
print(type(s))
print(s[0])

<class 'pandas.Series'>
1

In [7]:
print(s[3])

4

In [8]:
s = pd.Series(["23","21","25","31"],index =["Adam","eva","finch","sachin"])
print(s)
s

Adam      23
eva       21
finch     25
sachin    31
dtype: str

Adam      23
eva       21
finch     25
sachin    31
dtype: str

In [9]:
print(s["Adam"])
print(s["sachin"])

23
31

In [10]:
print(s.index)

Index(['Adam', 'eva', 'finch', 'sachin'], dtype='str')

In [11]:
# property
# homogenous,vectorized operation
#handle missing value with Nan
#mutable value , immutable size

In [12]:
 # data Frames  - 2D labelled Array

In [13]:
info = {
    "Name" : ["Adam" , "eve"],
    "Age":[21,24],
    "CGPA":[9.8,9.4],


}

In [14]:
df = pd.DataFrame(info)
print(df,type(df))

   Name  Age  CGPA
0  Adam   21   9.8
1   eve   24   9.4 <class 'pandas.DataFrame'>

In [15]:
df

   Name  Age  CGPA
0  Adam   21   9.8
1   eve   24   9.4

In [16]:
print(df.index)

RangeIndex(start=0, stop=2, step=1)

In [17]:
print(df.columns)

Index(['Name', 'Age', 'CGPA'], dtype='str')

In [18]:
df = pd.DataFrame([["Harsh",21],["Virat",33],["Rohit",36]],columns=["Name","Age"])

In [19]:
print(df)

    Name  Age
0  Harsh   21
1  Virat   33
2  Rohit   36

In [20]:
np_arr=np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(np_arr,columns  = ["A","B","C"])

In [21]:
print(df)

   A  B  C
0  1  2  3
1  4  5  6

In [22]:
# csv file 
df = pd.read_csv("employee_data.csv")
print(df,type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.DataFrame'>

In [23]:
df

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [26]:
df
# json data

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [25]:
#df = pd.read_json("employee_data.json")
#print(df,type(df))